# Сложение списков в списке (поэлементное)
a = [[1, 2, 3, 4], [11, 22, 33, 44], [111, 222, 333, 444]]
b = [[10, 20, 30, 40], [100, 200, 300, 400], [1000, 2000, 3000, 4000]]
c = []
for i, row in enumerate(a):
    r = []
    for j, x in enumerate(row):
        r.append(x + b[i][j])
    c.append(r)
print(c)

# Результат - список, являющийся поэлементной суммой элементов списков а и b:
# с = [[11, 22, 33, 44], [111, 222, 333, 444], [1111, 2222, 3333, 4444]]

# =============================================================================
# ПРИМЕР сложения обычных списков при помощи ZIP и генератора списков

x1 = [1, 2, 3, 4, 5]
x2 = [10, 20, 30, 40, 50]
x3 = [100, 200, 300, 400, 500]
y = [a1 + a2 + a3 for a1, a2, a3 in zip(x1, x2, x3)]
print(y)

# [111, 222, 333, 444, 555]

