# Частично информация находится в "Списки. Матрица M x N"

# Рандомный генератор списков:

from random import randint
n = 15
a = [randint(-100, 100) for j in range(n)]
print(a)

# =============================================================================
# Генератор списков - таблица умножения:

n = [f'{i} x {j} = {i*j}' for i in range(1, 10) for j in range(1, 10)]
for i in range((10-1)**2):
    print(n[i])


# =============================================================================
# Сложение обычных списков при помощи ZIP и генератора списков

x1 = [1, 2, 3, 4, 5]
x2 = [10, 20, 30, 40, 50]
x3 = [100, 200, 300, 400, 500]
y = [a1 + a2 + a3 for a1, a2, a3 in zip(x1, x2, x3)]
print(y)

# [111, 222, 333, 444, 555]


# =============================================================================
# Сложение вложенных списков при помощи ZIP и генератора списков.
# Складываемые списки должны быть одинаковы по длине вложенных списков.

# =============================================================================
# Сложение обычных списков при помощи ZIP и генератора списков

x1 = [[1, 2, 3], [4, 5], [6, 7, 8, 9]]
x2 = [[10, 20, 30], [40, 50], [60, 70, 80, 90]]
x3 = [[100, 200, 300], [400, 500], [600, 700, 800, 900]]
y = [0] * len(x1)
for i in range(len(x1)):
    y[i] = [a1 + a2 + a3 for a1, a2, a3 in zip(x1[i], x2[i], x3[i])]
print(y)

# [[111, 222, 333], [444, 555], [666, 777, 888, 999]]


# =============================================================================
#  Cозданиe трехмерного массива с помощью генератора списков

l1 = [[['*' for a in range(3)] for a in range(4)] for a in range(5)]
for i in l1:
    print(i)
